# MEPNetworkSegmentData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentData Class
Members See Also
---
Represents the analysis data for one network segment.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class MEPNetworkSegmentData : IDisposable
```

Visual Basic
---
```text
Public Class MEPNetworkSegmentData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MEPNetworkSegmentData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..MEPNetworkSegmentData
# See Also
MEPNetworkSegmentData Members
Autodesk.Revit.DB.Analysis Namespace